---
kind: method
id: M:Autodesk.Revit.DB.Connector.GetFabricationConnectorInfo
zh: 连接件、接口
source: html/6cff3851-aad9-ae38-fdc5-4f3554d03709.htm
---
# Autodesk.Revit.DB.Connector.GetFabricationConnectorInfo Method

**中文**: 连接件、接口

Gets fabrication connectivity information.

## Syntax (C#)
```csharp
public FabricationConnectorInfo GetFabricationConnectorInfo()
```

## Returns
Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no fabrication connector information associated.